{
  "id": "t-34",
  "name": "T-34",
  "period": "ww2",
  "type": "medium",
  "nation": "USSR",
  "photos": [
    "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Char_T-34.jpg/1024px-Char_T-34.jpg",
    "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/T-34-76_RB6.JPG/1024px-T-34-76_RB6.JPG"
  ],
  "description": "From Wikipedia, the free encyclopedia\n The T-34 was a Soviet medium tank that had a profound and lasting effect on the field of tank design. Although its armour and armament were surpassed later in the war, it has often been credited as the most effective, efficient and influential tank design of the Second World War.[5] At its introduction, the T-34 possessed an unprecedented combination of firepower, mobility, protection and ruggedness. Its 76.2 mm (3 in) high-velocity tank gun provided a substantial increase in firepower over any of its contemporaries;[6] its heavy sloped armour was difficult to penetrate by most contemporary anti-tank weapons. When first encountered in 1941, the German tank general von Kleist called it \"the finest tank in the world\"[7] and Heinz Guderian confirmed the T-34's \"vast superiority\" over existing German armour of the period.[8][9]\nThe T-34 was the mainstay of Soviet armoured forces throughout the Second World War. Its design allowed it to be continuously refined to meet the constantly evolving needs of the Eastern Front: as the war went on it became more capable, but also quicker and cheaper to produce. Soviet industry would eventually produce over 80,000 T-34s of all variants, allowing steadily greater numbers to be fielded as the war progressed despite the loss of thousands in combat against the German Wehrmacht.[10] Replacing many light and medium tanks in Red Army service, it was the most-produced tank of the war, as well as the second most produced tank of all time (after its successor, the T-54/55 series).[11] Its development led directly to the T-54 and T-55 series of tanks, which in turn evolved into the later T-62, T-72, and T-90 that form the armoured mainstay of many modern armies. T-34 variants were widely exported after World War II and as late as 1996 were still in service in at least 27 countries."
}
