{
  "id": "p40",
  "name": "Curtiss P-40 Warhawk",
  "period": "ww2",
  "type": "fighter",
  "nation": "USA",
  "description": "From Wikipedia, the free encyclopedia\n The Curtiss P-40 Warhawk is an American single-engined, single-seat, all-metal fighter and ground-attack aircraft that first flew in 1938. The P-40 design was a modification of the previous Curtiss P-36 Hawk which reduced development time and enabled a rapid entry into production and operational service. The Warhawk was used by most Allied powers during World War II, and remained in frontline service until the end of the war. It was the third most-produced American fighter, after the P-51 and P-47; by November 1944, when production of the P-40 ceased, 13,738 had been built,[4] all at Curtiss-Wright Corporation's main production facilities at Buffalo, New York.\nP-40 Warhawk was the name the United States Army Air Corps and after June 1941, USAAF-adopted name for all models, making it the official name in the U.S. for all P-40s. The British Commonwealth and Soviet air forces used the name Tomahawk for models equivalent to the P-40B and P-40C, and the name Kittyhawk for models equivalent to the P-40D and all later variants.\nP-40s first saw combat with the British Commonwealth squadrons of the Desert Air Force in the Middle East and North African campaigns, during June 1941.[5][6] No. 112 Squadron Royal Air Force, was among the first to operate Tomahawks in North Africa and the unit was the first Allied military aviation unit to feature the \"shark mouth\" logo,[7][8] copying similar markings on some Luftwaffe Messerschmitt Bf 110 twin-engine fighters.[7] [N 1]\nThe P-40's lack of a two-speed supercharger made it inferior to Luftwaffe fighters such as the Messerschmitt Bf 109 or the Focke-Wulf Fw 190 in high-altitude combat and it was rarely used in operations in Northwest Europe. However, between 1941 and 1944, the P-40 played a critical role with Allied air forces in three major theaters: North Africa, the Southwest Pacific, and China. It also had a significant role in the Middle East, Southeast Asia, Eastern Europe, Alaska and Italy. The P-40's performance at high altitudes was not as important in those theaters, where it served as an air superiority fighter, bomber escort and fighter-bomber. Although it gained a postwar reputation as a mediocre design, suitable only for close air support, recent research including scrutiny of the records of individual Allied squadrons indicates that this was not the case: the P-40 performed surprisingly well as an air superiority fighter, at times suffering severe losses but also taking a very heavy toll of enemy aircraft.[10] The P-40 offered the additional advantage of low cost, which kept it in production as a ground-attack aircraft long after it was obsolete as a fighter."
}
