{
  "id": "m4",
  "name": "M4 Sherman",
  "period": "ww2",
  "type": "medium",
  "nation": "USA",
  "description": "From Wikipedia, the free encyclopedia\nThe M4 Sherman, officially Medium Tank, M4, was the most numerous battle tank used by the United States and some of the other Western Allies in World War II. The M4 Sherman proved to be reliable, relatively cheap to produce and available in great numbers. Thousands were distributed through the Lend-Lease program to the British Commonwealth and Soviet Union. The tank was named by the British for the American Civil War General William Tecumseh Sherman.\nThe M4 Sherman evolved from the interim M3 Medium Tank,[N 1] which had its main armament in a side sponson mount. The M4 retained much of the previous mechanical design, but put the main 75 mm gun in a fully traversing turret. One feature, a one-axis gyrostabilizer, was not precise enough to allow firing when moving but did help keep the reticle on target, so that when the tank did stop to fire, the gun would be aimed in roughly the right direction.[6] The designers stressed mechanical reliability, ease of production and maintenance, durability, standardization of parts and ammunition in a limited number of variants, and moderate size and weight. These factors, combined with the Sherman's then-superior armor and armament, outclassed German light and medium tanks fielded in 1939-42. The M4 went on to be produced in large numbers. It spearheaded many offensives by the Western Allies after 1942.\nWhen the M4 tank went into combat in North Africa with the British Army at El Alamein in the autumn of 1942, it increased the advantage of Allied armor over Axis armor and was superior to the lighter German[7] and Italian tank designs. For this reason, the US Army believed that the M4 would be adequate to win the war, and no pressure was exerted for further tank development. Logistical and transport restrictions, such as limitations imposed by roads, ports, and bridges, also complicated the introduction of a more capable but heavier tank.[8][N 2] Tank destroyer battalions using vehicles built on the M4 hull and chassis, but with open-topped turrets and more potent high-velocity guns, also entered widespread use in the Allied armies. Even by 1944, most M4 Shermans kept their dual purpose 75 mm gun.[9] By 1944, the M4 was inferior to the increasing numbers of German heavy tanks, but was able to fight on with mutual support from numerical superiority and with support from growing numbers of fighter-bombers and artillery pieces.[10]\nThe relative ease of production allowed large numbers of the M4 to be manufactured, and significant investment in tank recovery and repair units allowed disabled vehicles to be repaired and returned to service quickly. These factors combined to give the Allies numerical superiority in most battles, and many infantry divisions were provided with M4s and tank destroyers.[N 3][11]\nAfter World War II, the Sherman, particularly the many improved and upgraded versions, continued to see combat service in many conflicts around the world, including the UN forces in the Korean War, with Israel in the Arab-Israeli Wars, briefly with South Vietnam in the Vietnam War, and on both sides of the Indo-Pakistani War of 1965.[12]"
}
